/**
 * 没当访问页面时切换底部的poem
 */

//定义存储诗词的字符串数组
		var poems =["待到秋来九月八，我花开尽百花杀",
			"黄四娘家花满蹊，千朵万朵压枝低","靖康耻，犹未雪；臣子恨，何时灭",
			"小桃无主自花开，烟草茫茫带晚鸦","几处败垣围故井，向来一一是人家",
			"飞雪连天射白鹿，笑书神侠倚碧鸳","桃花影落飞神剑，碧海潮生按玉箫",
			"金凤玉露一相逢，便胜却人间无数","人间自是有情痴，此事不关风与月",
			"况是青春日将暮，桃花乱落如红雨","一叶随风忽报秋，纵使君来岂堪折",
			"疏影横斜水清浅，暗香浮动月黄昏",
			"歌管楼台声细细，秋千院落夜沉沉","无人争晓渡，残月下寒沙",
			"三十功名尘与土，八千里路云和月","二十四桥仍在，波心荡，冷月无心",
			"踏青归来春犹浅，明日重来花满床","山门一笑无拘拟，云在西湖月在天",
			"英雄出在年少，有志不在年高","南朝四百八十寺，多少楼台烟雨中","望从斜阳欲尽时，不见西飞燕"],
			len  = poems.length;
		
		//获取1到max之间的随机数
		function getRandomNum(max){
			return Math.ceil(Math.random()*max);
		}
		
		function changePoems(){
			var p = document.getElementById("poem");
			var num = getRandomNum(len)-1;  //获得一个数组下标
			//取诗
			var poem = poems[num];
			//替换诗
			p.innerHTML = poem;
		}